Table of Contents
 Enum NationalAnnexCode
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Annex code
public enum NationalAnnexCode
Fields
Austrian = 3
Austria national annex
Belgian = 6
Belgian national annex
British = 8
British national annex
Czech = 1
Czech national annex
Dutch = 5
Dutch national annex
French = 7
France national annex
German = 4
Germany national annex
NoAnnex = 0
No national annex defined
Polish = 10
Polish national annex
Singapore = 9
Singapore national annex
Slovak = 2
Slovak national annex
Fields
 Name |  Description
 Austrian = 3
Austria national annex
 Belgian = 6
Belgian national annex
 British = 8
British national annex
 Czech = 1
Czech national annex
 Dutch = 5
Dutch national annex
 French = 7
France national annex
 German = 4
Germany national annex
 NoAnnex = 0
No national annex defined
 Polish = 10
Polish national annex
 Singapore = 9
Singapore national annex
 Slovak = 2
Slovak national annex
 Edit this page